
# Work 1.

# Guess the output of this code:

# my answer is: 4

list = [8,4,2,6]

list.remove(2)
print(len(list)+list.count(6))

# აქ კონკრეტულად შექმნილია სია, რომელშიც შეტანილია რიცხვითი მნიშვნელობები. შემდეგ კი list - ის ერთ-ერთი ფუნქციით remove - თი ამოშალეს მეორე ინდექსად მდგომი მნიშვნელობა. საბოლოოდ კი დაპრინტეს ამ სიის სიგრძის და ამ სიაში შეტანილი მნიშვნელობა 6-ის რაოდენობის ჯამი, რაც საბოლოოდ გამოვიდა 4.



# Work 2.

name = input("Enter your name: ")

queue = ['John' , 'Amy' , 'Bob' , 'Adam']

queue.append(name)

print("Updated name list is: " + str(queue))


# დავწერეთ პროგრამა სადაც მომხმარებელს ვატანინებთ სახელს, რომელიც უკვე ემატება არსებულ სახელთა სიაში. შემდეგ კი გამოგვაქვს განახლებული სახელთა სია.