

# work 1


# my answer = 4

# თავდაპირველად სიიდან ამოშლის რიცხვით მნიშვნელობა 2 - ს და გაანახლებს სიას. შემდეგ კი უკვე დაპრინტავს სიის ხანგრძლივობისა და სიაში არსებული რიცხვით მნიშვნელობა 6 - ს რაოდენობას, რის შემდეგაც დაბეჭდავს ჯამს.


list = [8 , 4, 2, 6]
list.remove(2)
print(len(list) + list.count(6))

# My answer is correct


# Work 2.

# my answer = 4

# ჯერ გვაქ მოცემული რიცვთა სია, სადაც insert - ფუნქციით პირველ ინდექსად მდგარ რიცხვს ვანაცვკებთ სამიანით. შემდეგ კი სიიდან ამოგვაქვს კონკრეტული რიცხვითი მნიშვნელობა 9. ამის შემდეგ კი 0 ინდექსად მდგარ მნიშვნელობას ვანაცვლებთ მნიშვნელობით რომელიც ითვლის სიაში არსებულ 8 - ების რაოდენობას და ანაცვლებს მას. ბოლოს კი ახალი სიიდან გამოგვაქვს მესამე ინდექსად მდგარი მნიშვნელობა.

# my answewr is correct 


nums = [2,4,8,9,5]



nums.insert(1,3)

nums.remove(9)

nums.insert(0, nums.count(8))

print(nums[3])


# Work 3


name = input("Enter name: ")


queue = ['John' , 'Amy' , 'Bob' , 'Adam']

queue.append(name)

print("Updated name list is: " + str(queue))


# დავწერეთ პროგრამა სადახ მომხმარებელს ვატანინებთ სახელს, რომელიც უკვე ემატება არსებულ სახელთა სიაში. შემდეგ კლი გამოგვაქვს განახლებული სახელთსა სია.


