
#Homework 1. (ცვლადების ჯამი)

num1 = 20

num2 = 14

num3 = 93

print(num1 + num2 + num3) # შევქმენით 3 ცვლადი რიცხვებზე და დავპრინტეთ მათი ჯამი.

# Homework 2.  (ცვლადების ნამრავლი)

x = 28 

y = 62

print( x * y) # შევქმენით ცვლადი x , y და დავპრინტეთ მათი ნამრავლი.


# Homework 3. (მართკუთხედის პერიმეტრი)

length = 20

width = 10 

print(length * 2 + width * 2) # დავიანგარიშეთ მართხკუთხედის პერიმეტრი ცვლადების მეშვეობით


# Homework 4. (ცვლადის შექმნის თითოეული ნაბიჯი) 

# ცვლადის შექმნამდე, ჯერ უნდა ჩამოვყალიბდეთ თუ რაზე ვქმნით ცვლადს, და ჩავწეროთ იგი. 

# ცვლადის სახის ჩაწერის შემდეგ უნდა დავწეროთ = ნიშანი რომელიც გამოსახავს და აკავშირებს ცვლადის სახეს, ასევე მის უშუალო მნიშვნელობას რომელსაც ვანიჭებთ.  Age = 14 , Country = ('Georgia') 

# ამის შემდეგ კი რამდენი ცვლადიცა და მნიშვნელობაც გვექნება, მათ დახმარებით ავაწყოთ წინადადება.

#print("hello i am" , age , "years old and i am from" , country )
