
# Work 1. 

# Game Development - პროგრამირების განხრა, რომელიც სწავლობს თამაშების შექმნას, როგორც მცირე ისევე ფართო მასშტაბიან.

# Ai - ხელოვნური ინტელექტი, რომელიც გვეხმარება ყოველდღიურ ცხოვრებაში გარკვეულ დავალებებში და არა მარტო.

# Web Development - ვებ დეველოპერის ძირითადი სამუშაოა ვებსაიტების შექმნა. მიუხედავად იმისა, რომ მათი მთავარი როლი არის უზრუნველყონ ვებგვერდი ვიზუალურად მიმზიდველი და მარტივი ნავიგაციით, ბევრი ვებ დეველოპერი ასევე პასუხისმგებელია ვებსაიტის მუშაობასა და მის შემდგომ შესაძლებლობებზე.

# Work 2.

# Front - End - პროგრამირების უშუალო ნაწილი, რომელიც უზრუნველყოფს მომხმარებლისთვის საიტის წინა, ვიზუალური მხარის წარმოჩენას.

# Back - End - პროგრამირებს ნაწილი, რომელიც მოიცავს ინფორმაციას მთლიანად იმ საიტისა თუ პროგრამის შესახებ რომელზეც გვაქ წარმოდგენა. საიტისა თუ პროგრამის უკანა ნაწილი. ინფორმაცია, რომელიც გვჭირდება ვებ-საიტზე.
