
# Work 1.

# Sequence - ოპერაცია, გადაითარგმნება როგორც "თანმიმდევრობა", პროგრამირებაში კი გამოიყენება იმისთვის რომ მივცეთ ბრძანებები კომპიუტერს და მან ისინი თანმიმდევრობით შეასრულოს.

# Iteration - ეს არის ოპერაცია, რომელიც საშუალებას გვაძლევს გავიმეოროთ გარკვეული კოდი რომელიც ჩვენ უშუალოდ მივანიჭეთ მიდენჯერ რამდენჯერაც გადავცემთ პირობაში, ან მანამ, სანამ პირობა შესრულდება.

# Selection - პროგრამის გადაწყვეტილების მიღების უშუალოდ პროცესი, სადაც გარკვეული ჩვენს მიერ მინიჭებული პირობა განსაზღვრავს, რომელი კოდი უნდა შესრულდეს.




# Work 2.


age = 22

if age >= 18:
    print("You are an adult.")
else:
    print("You are a Child.")




# Work 3.

goa = 100 

while goa > 50:
    print("GOA")
    goa = goa - 1


# Work 4.

x = 50
while x > 0:
    print(x)   
    x = x - 1 


# Work 5.

# version 1

x = 30
while x > 0:
    print(x)
    x = x - 2

# version 2
    
x = 30

while x > 0:
    if x % 2 == 0:
        print(x)
        x = x - 2
      



