

# Work 1. (რა არის bug და debugging)



# Bug - გვხვდება კოდის წერისას, ნიშნავს დაშვებულ შეცდომას. იგი მიგვანიშნებს შეცდომასა და ხარვეზზე კოდში.

# Debugging - გვხვდება კოდის წერისას, ნიშნავს პროცესს, როცა ვპოულობთ ხარვეზს უშუალოდ კოდში და ვცდილობთ მის აღმოფხვრას.



# Work 2. (ტექსტური მნიშვნელობები,რიცხვითი მნიშვნელობები)

# String - მნიშვნელობა, რომელსაც ვანიჭებთ ტექსტურ აზრს. გვხვდება ცვლადებისთვის მნიშვნელობის მინიჭების დროს.

# Integer - მნიშვნელობა, რომელსაც ვანიჭებთ რიცხვით აზრს. გვხვდება ცვლადებისთვის მნიშვნელობის მინიჭებიოს დროს.



# Work 3. (რატომ არის საჭირო კომენტარების წერა)

# კომენტარის წერა აუცილებელი პირობაა უშუალოდ პროექტისა თუ უბრალოდ კოდის წერის დროს, კომენტარების მეშვეობიტ ჩვენ სხვებს ვუხსნით და ვუზიარებთ ჩვენს მიერ გაკეთებულ სამუშაოს.
# ვუხსნით კოდის პრინციპს და მის აზრს, კომენტარები შექმნილია ადამიანებისთვის და სხვა პროგრამისტებისთვის, შენი აზრის უკეთ გაგებისთვის.



# Work 4. (15 მაგალითი ყველა ნაცნობ ოპერატორზე)


# მიმატება

print(10 + 4)
print(20 + 11)
print(29 + 23)
print(72 + 2)
print(7 + 23)
print(24 + 22)
print(13 + 19)
print(77 + 21)
print(99 + 11)
print(52 + 66)
print(222 + 367)
print(900 + 100)
print(789 + 234)
print(2727 + 239)
print(2893 + 5294)


# გამოკლება

print(20 - 10)
print(66 - 23)
print(27 - 26)
print(88 - 66)
print(10 - 10)
print(59 - 29)
print(67 - 59)
print(43 - 32)
print(90 - 22)
print(110 - 107)
print(238 - 129)
print(634 - 257)
print(234 - 110)
print(1099 - 1098)
print(7777 - 6666)

# გამრავლება

print(2 * 2)
print(4 * 3)
print(7 * 4)
print(21 * 7)
print(11 * 11)
print(13 * 21)
print(10 * 10)
print(12 * 12)
print(21 * 21)
print(13 * 89)
print(22 * 22)
print(53 * 50)
print(98 * 61)
print(2000 * 2000)
print(1289 * 3498)

# გაყოფა (2 ტიპი)

# ტიპი 1

print(20 / 2)
print(10 / 5)
print(70 / 7)
print(36 / 6)
print(56 / 8)
print(98 / 10)
print(110 /10)
print(100 / 4)
print(999 / 100)
print(1250 / 250)
print(2220 / 222)
print(9000 / 900)
print(7633 / 313)
print(3333 / 333)
print(7400 / 200)

# ტიპი 2

print(5 // 5)
print(9 // 3)
print(6 // 2)
print(25 // 5)
print(50 // 5)
print(80 // 20)
print(77 // 11)
print(100 // 10)
print(121 // 11)
print(130 // 13)
print(2020 // 20)
print(1111 // 111)
print(1348 // 344)
print(9882 // 438)
print(6739 // 583)


